FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_pint.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pint.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
    #define FSL_COMPONENT_ID    "platform.drivers.pint"
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

#if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
/*! @brief Irq number array */
    static const IRQn_Type s_pintIRQ[ FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS +
                                      FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ] = PINT_IRQS;

/*! @brief Callback function array for SECPINT(s). */
    static pint_cb_t s_secpintCallback[ FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ];
#else
/*! @brief Irq number array */
    static const IRQn_Type s_pintIRQ[ FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] = PINT_IRQS;
#endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */

/*! @brief Callback function array for PINT(s). */
static pint_cb_t s_pintCallback[ FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ];

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief	Initialize PINT peripheral.
 *
 * This function initializes the PINT peripheral and enables the clock.
 *
 * param base Base address of the PINT peripheral.
 *
 * retval None.
 */
void PINT_Init( PINT_Type * base )
{
    uint32_t i;
    uint32_t pmcfg = 0;
    uint8_t pintcount = 0;

    assert( base != NULL );

    if( base == PINT )
    {
        pintcount = FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS;

        /* clear PINT callback array*/
        for( i = 0; i < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
        {
            s_pintCallback[ i ] = NULL;
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            pintcount = FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS;

            /* clear SECPINT callback array*/
            for( i = 0; i < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
            {
                s_secpintCallback[ i ] = NULL;
            }
        #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
    }

    /* Disable all bit slices for pint*/
    for( i = 0; i < pintcount; i++ )
    {
        pmcfg = pmcfg | ( ( uint32_t ) kPINT_PatternMatchNever << ( PININT_BITSLICE_CFG_START + ( i * 3U ) ) );
    }

    #if defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 1 )
        #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
            /* Enable the clock. */
            CLOCK_EnableClock( kCLOCK_GpioInt );
        #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
        #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
            /* Reset the module. */
            RESET_PeripheralReset( kGPIOINT_RST_N_SHIFT_RSTn );
        #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
    #elif defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 0 )
        if( base == PINT )
        {
            #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                /* Enable the clock. */
                CLOCK_EnableClock( kCLOCK_Gpio0 );
            #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
            #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                /* Reset the module. */
                RESET_PeripheralReset( kGPIO0_RST_N_SHIFT_RSTn );
            #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
        }
        else
        {
            #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
                #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                    /* Enable the clock. */
                    CLOCK_EnableClock( kCLOCK_Gpio_Sec );
                #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
                #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                    /* Reset the module. */
                    RESET_PeripheralReset( kGPIOSEC_RST_SHIFT_RSTn );
                #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
            #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
        }
    #else  /* if defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 1 ) */
        if( base == PINT )
        {
            #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                /* Enable the clock. */
                CLOCK_EnableClock( kCLOCK_Pint );
            #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
            #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                /* Reset the module. */
                RESET_PeripheralReset( kPINT_RST_SHIFT_RSTn );
            #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
        }
        else
        {
            /* if need config SECURE PINT device,then enable secure pint interrupt clock */
            #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
                #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                    /* Enable the clock. */
                    CLOCK_EnableClock( kCLOCK_Gpio_Sec_Int );
                #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
                #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                    /* Reset the module. */
                    RESET_PeripheralReset( kGPIOSECINT_RST_SHIFT_RSTn );
                #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
            #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
        }
    #endif /* FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE */

    /* Disable all pattern match bit slices */
    base->PMCFG = pmcfg;
}

/*!
 * brief	Configure PINT peripheral pin interrupt.
 *
 * This function configures a given pin interrupt.
 *
 * param base Base address of the PINT peripheral.
 * param intr Pin interrupt.
 * param enable Selects detection logic.
 * param callback Callback.
 *
 * retval None.
 */
void PINT_PinInterruptConfig( PINT_Type * base,
                              pint_pin_int_t intr,
                              pint_pin_enable_t enable,
                              pint_cb_t callback )
{
    assert( base != NULL );

    /* Clear Rise and Fall flags first */
    PINT_PinInterruptClrRiseFlag( base, intr );
    PINT_PinInterruptClrFallFlag( base, intr );

    /* Security PINT uses additional callback array */
    if( base == PINT )
    {
        s_pintCallback[ intr ] = callback;
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            s_secpintCallback[ intr ] = callback;
        #endif
    }

    /* select level or edge sensitive */
    base->ISEL = ( base->ISEL & ~( 1UL << ( uint32_t ) intr ) ) |
                 ( ( ( ( uint32_t ) enable & PINT_PIN_INT_LEVEL ) != 0U ) ? ( 1UL << ( uint32_t ) intr ) : 0U );

    /* enable rising or level interrupt */
    if( ( ( unsigned ) enable & ( PINT_PIN_INT_LEVEL | PINT_PIN_INT_RISE ) ) != 0U )
    {
        base->SIENR = 1UL << ( uint32_t ) intr;
    }
    else
    {
        base->CIENR = 1UL << ( uint32_t ) intr;
    }

    /* Enable falling or select high level */
    if( ( ( unsigned ) enable & PINT_PIN_INT_FALL_OR_HIGH_LEVEL ) != 0U )
    {
        base->SIENF = 1UL << ( uint32_t ) intr;
    }
    else
    {
        base->CIENF = 1UL << ( uint32_t ) intr;
    }
}

/*!
 * brief	Get PINT peripheral pin interrupt configuration.
 *
 * This function returns the configuration of a given pin interrupt.
 *
 * param base Base address of the PINT peripheral.
 * param pintr Pin interrupt.
 * param enable Pointer to store the detection logic.
 * param callback Callback.
 *
 * retval None.
 */
void PINT_PinInterruptGetConfig( PINT_Type * base,
                                 pint_pin_int_t pintr,
                                 pint_pin_enable_t * enable,
                                 pint_cb_t * callback )
{
    uint32_t mask;
    bool level;

    assert( base != NULL );

