FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_pint.c
    *enable = kPINT_PinIntEnableNone;
    level = false;

    mask = 1UL << ( uint32_t ) pintr;

    if( ( base->ISEL & mask ) != 0U )
    {
        /* Pin interrupt is level sensitive */
        level = true;
    }

    if( ( base->IENR & mask ) != 0U )
    {
        if( level )
        {
            /* Level interrupt is enabled */
            *enable = kPINT_PinIntEnableLowLevel;
        }
        else
        {
            /* Rising edge interrupt */
            *enable = kPINT_PinIntEnableRiseEdge;
        }
    }

    if( ( base->IENF & mask ) != 0U )
    {
        if( level )
        {
            /* Level interrupt is active high */
            *enable = kPINT_PinIntEnableHighLevel;
        }
        else
        {
            /* Either falling or both edge */
            if( *enable == kPINT_PinIntEnableRiseEdge )
            {
                /* Rising and faling edge */
                *enable = kPINT_PinIntEnableBothEdges;
            }
            else
            {
                /* Falling edge */
                *enable = kPINT_PinIntEnableFallEdge;
            }
        }
    }

    /* Security PINT uses additional callback array */
    if( base == PINT )
    {
        *callback = s_pintCallback[ pintr ];
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            *callback = s_secpintCallback[ pintr ];
        #endif
    }
}

/*!
 * brief	Configure PINT pattern match.
 *
 * This function configures a given pattern match bit slice.
 *
 * param base Base address of the PINT peripheral.
 * param bslice Pattern match bit slice number.
 * param cfg Pointer to bit slice configuration.
 *
 * retval None.
 */
void PINT_PatternMatchConfig( PINT_Type * base,
                              pint_pmatch_bslice_t bslice,
                              pint_pmatch_cfg_t * cfg )
{
    uint32_t src_shift;
    uint32_t cfg_shift;
    uint32_t pmcfg;
    uint32_t tmp_src_shift = PININT_BITSLICE_SRC_MASK;
    uint32_t tmp_cfg_shift = PININT_BITSLICE_CFG_MASK;

    assert( base != NULL );

    src_shift = PININT_BITSLICE_SRC_START + ( ( uint32_t ) bslice * 3UL );
    cfg_shift = PININT_BITSLICE_CFG_START + ( ( uint32_t ) bslice * 3UL );

    /* Input source selection for selected bit slice */
    base->PMSRC = ( base->PMSRC & ~( tmp_src_shift << src_shift ) ) | ( ( uint32_t ) ( cfg->bs_src ) << src_shift );

    /* Bit slice configuration */
    pmcfg = base->PMCFG;
    pmcfg = ( pmcfg & ~( tmp_cfg_shift << cfg_shift ) ) | ( ( uint32_t ) ( cfg->bs_cfg ) << cfg_shift );

    /* If end point is true, enable the bits */
    if( ( uint32_t ) bslice != 7UL )
    {
        if( cfg->end_point )
        {
            pmcfg |= ( 1UL << ( uint32_t ) bslice );
        }
        else
        {
            pmcfg &= ~( 1UL << ( uint32_t ) bslice );
        }
    }

    base->PMCFG = pmcfg;

    /* Save callback pointer */
    if( base == PINT )
    {
        if( ( uint32_t ) bslice < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS )
        {
            s_pintCallback[ bslice ] = cfg->callback;
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            if( ( uint32_t ) bslice < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            {
                s_secpintCallback[ bslice ] = cfg->callback;
            }
        #endif
    }
}

/*!
 * brief	Get PINT pattern match configuration.
 *
 * This function returns the configuration of a given pattern match bit slice.
 *
 * param base Base address of the PINT peripheral.
 * param bslice Pattern match bit slice number.
 * param cfg Pointer to bit slice configuration.
 *
 * retval None.
 */
void PINT_PatternMatchGetConfig( PINT_Type * base,
                                 pint_pmatch_bslice_t bslice,
                                 pint_pmatch_cfg_t * cfg )
{
    uint32_t src_shift;
    uint32_t cfg_shift;
    uint32_t tmp_src_shift = PININT_BITSLICE_SRC_MASK;
    uint32_t tmp_cfg_shift = PININT_BITSLICE_CFG_MASK;

    assert( base != NULL );

    src_shift = PININT_BITSLICE_SRC_START + ( ( uint32_t ) bslice * 3UL );
    cfg_shift = PININT_BITSLICE_CFG_START + ( ( uint32_t ) bslice * 3UL );

    cfg->bs_src = ( pint_pmatch_input_src_t ) ( uint32_t ) ( ( base->PMSRC & ( tmp_src_shift << src_shift ) ) >> src_shift );
    cfg->bs_cfg = ( pint_pmatch_bslice_cfg_t ) ( uint32_t ) ( ( base->PMCFG & ( tmp_cfg_shift << cfg_shift ) ) >> cfg_shift );

    if( ( uint32_t ) bslice == 7U )
    {
        cfg->end_point = true;
    }
    else
    {
        cfg->end_point = ( ( ( base->PMCFG & ( 1UL << ( uint32_t ) bslice ) ) >> ( uint32_t ) bslice ) != 0U ) ? true : false;
    }

    if( base == PINT )
    {
        if( ( uint32_t ) bslice < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS )
        {
            cfg->callback = s_pintCallback[ bslice ];
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            if( ( uint32_t ) bslice < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            {
                cfg->callback = s_secpintCallback[ bslice ];
            }
        #endif
    }
}

/*!
 * brief	Reset pattern match detection logic.
 *
 * This function resets the pattern match detection logic if any of the product term is matching.
 *
 * param base Base address of the PINT peripheral.
 *
 * retval pmstatus Each bit position indicates the match status of corresponding bit slice.
 * = 0 Match was detected.  = 1 Match was not detected.
 */
uint32_t PINT_PatternMatchResetDetectLogic( PINT_Type * base )
{
    uint32_t pmctrl;
    uint32_t pmstatus;
    uint32_t pmsrc;

    pmctrl = base->PMCTRL;
    pmstatus = pmctrl >> PINT_PMCTRL_PMAT_SHIFT;

    if( pmstatus != 0UL )
    {
        /* Reset Pattern match engine detection logic */
        pmsrc = base->PMSRC;
        base->PMSRC = pmsrc;
    }

    return( pmstatus );
}

/*!
 * @brief	Clear Selected pin interrupt status only when the pin was triggered by edge-sensitive.
 *
 * This function clears the selected pin interrupt status.
 *
 * @param base Base address of the PINT peripheral.
 * @param pintr Pin interrupt.
 *
 * @retval None.
 */
void PINT_PinInterruptClrStatus( PINT_Type * base,
                                 pint_pin_int_t pintr )
{
    uint32_t pinIntMode = base->ISEL & ( 1UL << ( uint32_t ) pintr );
    uint32_t pinIntStatus = base->IST & ( 1UL << ( uint32_t ) pintr );

    /* Edge sensitive and pin interrupt that is currently requesting an interrupt. */
    if( ( pinIntMode == 0x0UL ) && ( pinIntStatus != 0x0UL ) )
    {
        base->IST = ( 1UL << ( uint32_t ) pintr );
    }
}

/*!
 * @brief	Clear all pin interrupts status only when pins were triggered by edge-sensitive.
 *
 * This function clears the status of all pin interrupts.
 *
 * @param base Base address of the PINT peripheral.
 *
 * @retval None.
 */
void PINT_PinInterruptClrStatusAll( PINT_Type * base )
{
    uint32_t pinIntMode = 0;
    uint32_t pinIntStatus = 0;
    uint32_t pinIntCount = 0;
    uint32_t mask = 0;
    uint32_t i;

    if( base == PINT )
    {
        pinIntCount = ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS;
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            pinIntCount = ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS;
        #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
    }

    for( i = 0; i < pinIntCount; i++ )
    {
        pinIntMode = base->ISEL & ( 1UL << i );
        pinIntStatus = base->IST & ( 1UL << i );

        /* Edge sensitive and pin interrupt that is currently requesting an interrupt. */
        if( ( pinIntMode == 0x0UL ) && ( pinIntStatus != 0x0UL ) )
        {
            mask |= 1UL << i;
        }
    }

