FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_pint.c
    base->IST = mask;
}

/*!
 * brief	Enable callback.
 *
 * This function enables the interrupt for the selected PINT peripheral. Although the pin(s) are monitored
 * as soon as they are enabled, the callback function is not enabled until this function is called.
 *
 * param base Base address of the PINT peripheral.
 *
 * retval None.
 */
void PINT_EnableCallback( PINT_Type * base )
{
    uint32_t i;

    assert( base != NULL );

    if( base == PINT )
    {
        for( i = 0; i < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
        {
            PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) i );
            NVIC_ClearPendingIRQ( s_pintIRQ[ i ] );
            ( void ) EnableIRQ( s_pintIRQ[ i ] );
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            for( i = 0; i < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
            {
                PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) i );
                NVIC_ClearPendingIRQ( s_pintIRQ[ i + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
                ( void ) EnableIRQ( s_pintIRQ[ i + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
            }
        #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
    }
}

/*!
 * brief	enable callback by pin index.
 *
 * This function  enables callback by pin index instead of enabling all pins.
 *
 * param base Base address of the peripheral.
 * param pinIdx pin index.
 *
 * retval None.
 */
void PINT_EnableCallbackByIndex( PINT_Type * base,
                                 pint_pin_int_t pintIdx )
{
    assert( base != NULL );

    PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) pintIdx );

    #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
        /* Get the right security pint irq index in array */
        if( base == SECPINT )
        {
            pintIdx =
                ( pint_pin_int_t ) ( uint32_t ) ( ( uint32_t ) pintIdx + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS );
        }
    #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */

    NVIC_ClearPendingIRQ( s_pintIRQ[ pintIdx ] );
    ( void ) EnableIRQ( s_pintIRQ[ pintIdx ] );
}

/*!
 * brief	Disable callback.
 *
 * This function disables the interrupt for the selected PINT peripheral. Although the pins are still
 * being monitored but the callback function is not called.
 *
 * param base Base address of the peripheral.
 *
 * retval None.
 */
void PINT_DisableCallback( PINT_Type * base )
{
    uint32_t i;

    assert( base != NULL );

    if( base == PINT )
    {
        for( i = 0; i < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
        {
            ( void ) DisableIRQ( s_pintIRQ[ i ] );
            PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) i );
            NVIC_ClearPendingIRQ( s_pintIRQ[ i ] );
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            for( i = 0; i < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
            {
                ( void ) DisableIRQ( s_pintIRQ[ i + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
                PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) i );
                NVIC_ClearPendingIRQ( s_pintIRQ[ i + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
            }
        #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
    }
}

/*!
 * brief disable callback by pin index.
 *
 * This function disables callback by pin index instead of disabling all pins.
 *
 * param base Base address of the peripheral.
 * param pinIdx pin index.
 *
 * retval None.
 */
void PINT_DisableCallbackByIndex( PINT_Type * base,
                                  pint_pin_int_t pintIdx )
{
    assert( base != NULL );

    if( base == PINT )
    {
        ( void ) DisableIRQ( s_pintIRQ[ pintIdx ] );
        PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) pintIdx );
        NVIC_ClearPendingIRQ( s_pintIRQ[ pintIdx ] );
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            ( void ) DisableIRQ( s_pintIRQ[ ( uint32_t ) pintIdx + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
            PINT_PinInterruptClrStatus( base, ( pint_pin_int_t ) pintIdx );
            NVIC_ClearPendingIRQ( s_pintIRQ[ ( uint32_t ) pintIdx + ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS ] );
        #endif
    }
}

/*!
 * brief	Deinitialize PINT peripheral.
 *
 * This function disables the PINT clock.
 *
 * param base Base address of the PINT peripheral.
 *
 * retval None.
 */
void PINT_Deinit( PINT_Type * base )
{
    uint32_t i;

    assert( base != NULL );

    /* Cleanup */
    PINT_DisableCallback( base );

    if( base == PINT )
    {
        /* clear PINT callback array*/
        for( i = 0; i < ( uint32_t ) FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
        {
            s_pintCallback[ i ] = NULL;
        }
    }
    else
    {
        #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
            /* clear SECPINT callback array */
            for( i = 0; i < ( uint32_t ) FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS; i++ )
            {
                s_secpintCallback[ i ] = NULL;
            }
        #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
    }

    #if defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 1 )
        #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
            /* Enable the clock. */
            CLOCK_DisableClock( kCLOCK_GpioInt );
        #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
        #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
            /* Reset the module. */
            RESET_PeripheralReset( kGPIOINT_RST_N_SHIFT_RSTn );
        #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
    #elif defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 0 )
        if( base == PINT )
        {
            #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                /* Enable the clock. */
                CLOCK_DisableClock( kCLOCK_Gpio0 );
            #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
            #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                /* Reset the module. */
                RESET_PeripheralReset( kGPIO0_RST_N_SHIFT_RSTn );
            #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
        }
        else
        {
            #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
                #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                    /* Enable the clock. */
                    CLOCK_DisableClock( kCLOCK_Gpio_Sec );
                #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
                #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                    /* Reset the module. */
                    RESET_PeripheralReset( kGPIOSEC_RST_SHIFT_RSTn );
                #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
            #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
        }
    #else  /* if defined( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE ) && ( FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE == 1 ) */
        if( base == PINT )
        {
            #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                /* Enable the clock. */
                CLOCK_DisableClock( kCLOCK_Pint );
            #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
            #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                /* Reset the module. */
                RESET_PeripheralReset( kPINT_RST_SHIFT_RSTn );
            #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
        }
        else
        {
            /* if need config SECURE PINT device,then enable secure pint interrupt clock */
            #if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
                #if !( defined( FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL ) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL )
                    /* Enable the clock. */
                    CLOCK_DisableClock( kCLOCK_Gpio_Sec_Int );
                #endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
                #if !( defined( FSL_SDK_DISABLE_DRIVER_RESET_CONTROL ) && FSL_SDK_DISABLE_DRIVER_RESET_CONTROL )
                    /* Reset the module. */
                    RESET_PeripheralReset( kGPIOSECINT_RST_SHIFT_RSTn );
                #endif /* FSL_SDK_DISABLE_DRIVER_RESET_CONTROL */
            #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
        }
    #endif /* FSL_FEATURE_CLOCK_HAS_GPIOINT_CLOCK_SOURCE */
}
#if ( defined( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS ) && FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS )
/* IRQ handler functions overloading weak symbols in the startup */
    void SEC_GPIO_INT0_IRQ0_DriverIRQHandler( void );
    void SEC_GPIO_INT0_IRQ0_DriverIRQHandler( void )
    {
        uint32_t pmstatus = 0;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( SECPINT );

        /* Call user function */
        if( s_secpintCallback[ kPINT_SecPinInt0 ] != NULL )
        {
            s_secpintCallback[ kPINT_SecPinInt0 ]( kPINT_SecPinInt0, pmstatus );
        }

