FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/drivers/fsl_pint.c
        if( ( SECPINT->ISEL & 0x1U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( SECPINT, kPINT_PinInt0 );
        }

        SDK_ISR_EXIT_BARRIER;
    }

    #if ( FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS > 1U )
/* IRQ handler functions overloading weak symbols in the startup */
        void SEC_GPIO_INT0_IRQ1_DriverIRQHandler( void );
        void SEC_GPIO_INT0_IRQ1_DriverIRQHandler( void )
        {
            uint32_t pmstatus;

            /* Reset pattern match detection */
            pmstatus = PINT_PatternMatchResetDetectLogic( SECPINT );

            /* Call user function */
            if( s_secpintCallback[ kPINT_SecPinInt1 ] != NULL )
            {
                s_secpintCallback[ kPINT_SecPinInt1 ]( kPINT_SecPinInt1, pmstatus );
            }

            if( ( SECPINT->ISEL & 0x1U ) == 0x0U )
            {
                /* Edge sensitive: clear Pin interrupt after callback */
                PINT_PinInterruptClrStatus( SECPINT, kPINT_PinInt1 );
            }

            SDK_ISR_EXIT_BARRIER;
        }
    #endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */
#endif /* FSL_FEATURE_SECPINT_NUMBER_OF_CONNECTED_OUTPUTS */

/* IRQ handler functions overloading weak symbols in the startup */
void PIN_INT0_DriverIRQHandler( void );
void PIN_INT0_DriverIRQHandler( void )
{
    uint32_t pmstatus;

    /* Reset pattern match detection */
    pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

    /* Call user function */
    if( s_pintCallback[ kPINT_PinInt0 ] != NULL )
    {
        s_pintCallback[ kPINT_PinInt0 ]( kPINT_PinInt0, pmstatus );
    }

    if( ( PINT->ISEL & 0x1U ) == 0x0U )
    {
        /* Edge sensitive: clear Pin interrupt after callback */
        PINT_PinInterruptClrStatus( PINT, kPINT_PinInt0 );
    }

    SDK_ISR_EXIT_BARRIER;
}

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 1U )
    void PIN_INT1_DriverIRQHandler( void );
    void PIN_INT1_DriverIRQHandler( void )
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt1 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt1 ]( kPINT_PinInt1, pmstatus );
        }

        if( ( PINT->ISEL & 0x2U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt1 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 1U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 2U )
    void PIN_INT2_DriverIRQHandler( void );
    void PIN_INT2_DriverIRQHandler( void )
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt2 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt2 ]( kPINT_PinInt2, pmstatus );
        }

        if( ( PINT->ISEL & 0x4U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt2 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 2U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 3U )
    void PIN_INT3_DriverIRQHandler( void );
    void PIN_INT3_DriverIRQHandler( void )
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt3 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt3 ]( kPINT_PinInt3, pmstatus );
        }

        if( ( PINT->ISEL & 0x8U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt3 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 3U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 4U )
    void PIN_INT4_DriverIRQHandler( void );
    void PIN_INT4_DriverIRQHandler( void )
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt4 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt4 ]( kPINT_PinInt4, pmstatus );
        }

        if( ( PINT->ISEL & 0x10U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt4 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 4U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 5U )
    #if defined( FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER ) && FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER
        void PIN_INT5_DAC1_IRQHandler( void )
    #else
        void PIN_INT5_DriverIRQHandler( void );
        void PIN_INT5_DriverIRQHandler( void )
    #endif /* FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER */
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt5 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt5 ]( kPINT_PinInt5, pmstatus );
        }

        if( ( PINT->ISEL & 0x20U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt5 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 5U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 6U )
    #if defined( FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER ) && FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER
        void PIN_INT6_USART3_IRQHandler( void )
    #else
        void PIN_INT6_DriverIRQHandler( void );
        void PIN_INT6_DriverIRQHandler( void )
    #endif /* FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER */
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt6 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt6 ]( kPINT_PinInt6, pmstatus );
        }

        if( ( PINT->ISEL & 0x40U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt6 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 6U ) */

#if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 7U )
    #if defined( FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER ) && FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER
        void PIN_INT7_USART4_IRQHandler( void )
    #else
        void PIN_INT7_DriverIRQHandler( void );
        void PIN_INT7_DriverIRQHandler( void )
    #endif /* FSL_FEATURE_NVIC_HAS_SHARED_INTERTTUPT_NUMBER */
    {
        uint32_t pmstatus;

        /* Reset pattern match detection */
        pmstatus = PINT_PatternMatchResetDetectLogic( PINT );

        /* Call user function */
        if( s_pintCallback[ kPINT_PinInt7 ] != NULL )
        {
            s_pintCallback[ kPINT_PinInt7 ]( kPINT_PinInt7, pmstatus );
        }

        if( ( PINT->ISEL & 0x80U ) == 0x0U )
        {
            /* Edge sensitive: clear Pin interrupt after callback */
            PINT_PinInterruptClrStatus( PINT, kPINT_PinInt7 );
        }

        SDK_ISR_EXIT_BARRIER;
    }
#endif /* if ( FSL_FEATURE_PINT_NUMBER_OF_CONNECTED_OUTPUTS > 7U ) */
